webservice/axis2/common/src/main/SoapMessages.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope"
	xmlns:sec="http://schemas.xmlsoap.org/soap/security/2000-12"
	xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
	<soap:Header>
		<message-id>SA893@#9sdf(#sdfjkl3#2q</message-id>
		<sec:Signature>
			<ds:Signature>
				<ds:SignatureInfo>
					<ds:CanoicalizationMethod
						Algorithm="http://www.w3.org/TR/2000/CR-xml-c14n-20001026" />
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#dsa-shal" />
					<ds:Reference URI="#Body">
						<ds:Transforms>
							<ds:Transform
								Algorithm="http://www.w3.org/TR/2000/CR-xml-c14n-20001026" />
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#shal" />
						<ds:DigestValue>u29dj93nnfksu937w93u8sjd9=</ds:DigestValue>
					</ds:Reference>
				</ds:SignatureInfo>
				<ds:SignatureValue>CFFOMFCtVLrklR...</ds:SignatureValue>
			</ds:Signature>
		</sec:Signature>
	</soap:Header>
	<soap:Body sec:id="Body">
		<po:purchaseOrder orderDate="2000-12-21" xmlns:po="http://www.wstest.com/wstest/po"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<!-- -- -->
		</po:purchaseOrder>
	</soap:Body>
</soap:Envelope>
